Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewTransparentMode Property

---

"Show Surfaces Transparent"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewTransparentMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewTransparentMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewTransparentMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewTransparentMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace